src/test/jmeter/getSubmittedRequestsTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Get Submitted Requests" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Get Submitted Requests" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="293126858">
            <stringProp name="1508084419">${__P(pICThreadCount,5)}</stringProp>
            <stringProp name="140648723">${__P(pICInitialDelay,0)}</stringProp>
            <stringProp name="-12306606">${__P(pICRampupTime,5)}</stringProp>
            <stringProp name="2062137240">${__P(pICDuration,1800)}</stringProp>
            <stringProp name="-2067073939">${__P(pICRampDownPeriod,5)}</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="pHostname" elementType="Argument">
              <stringProp name="Argument.name">pHostname</stringProp>
              <stringProp name="Argument.value">${__P(pHostname,cipz-api-dev.prcp-np.us-east-1.aws.sysco.net)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="serverPortHTTPS" elementType="Argument">
              <stringProp name="Argument.name">serverPortHTTPS</stringProp>
              <stringProp name="Argument.value">${__P(port,80)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="serverProtocolHTTP" elementType="Argument">
              <stringProp name="Argument.name">serverProtocolHTTP</stringProp>
              <stringProp name="Argument.value">${__P(serverProtocolHTTP,http)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="serverProtocolHTTPS" elementType="Argument">
              <stringProp name="Argument.name">serverProtocolHTTPS</stringProp>
              <stringProp name="Argument.value">${__P(serverProtocolHTTPS,https)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="pICDuration" elementType="Argument">
              <stringProp name="Argument.name">pICDuration</stringProp>
              <stringProp name="Argument.value">${__P(pICDuration,30)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="pICTargetThroughput" elementType="Argument">
              <stringProp name="Argument.name">pICTargetThroughput</stringProp>
              <stringProp name="Argument.value">${__P(pICTargetThroughput,300)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="baseDir" elementType="Argument">
              <stringProp name="Argument.name">baseDir</stringProp>
              <stringProp name="Argument.value">${__BeanShell(import org.apache.jmeter.services.FileServer; FileServer.getFileServer().getBaseDir())}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="csvFileName" elementType="Argument">
              <stringProp name="Argument.name">csvFileName</stringProp>
              <stringProp name="Argument.value">${__P(pCSVFileName,data/testData.csv)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="offset" elementType="Argument">
              <stringProp name="Argument.name">offset</stringProp>
              <stringProp name="Argument.value">${__P(offset,0)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="limit" elementType="Argument">
              <stringProp name="Argument.name">limit</stringProp>
              <stringProp name="Argument.value">${__P(limit,20)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="requestId" elementType="Argument">
              <stringProp name="Argument.name">requestId</stringProp>
              <stringProp name="Argument.value">${__P(requestId,15984)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="request_submitter" elementType="Argument">
              <stringProp name="Argument.name">request_submitter</stringProp>
              <stringProp name="Argument.value">${__P(request_submitter,user1000)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="request_status" elementType="Argument">
              <stringProp name="Argument.name">request_status</stringProp>
              <stringProp name="Argument.value">${__P(request_status,PENDING_APPROVAL)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="businessUnitNumber" elementType="Argument">
              <stringProp name="Argument.name">businessUnitNumber</stringProp>
              <stringProp name="Argument.value">${__P(businessUnitNumber,068)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="itemAttributeGroupId" elementType="Argument">
              <stringProp name="Argument.name">itemAttributeGroupId</stringProp>
              <stringProp name="Argument.value">${__P(itemAttributeGroupId,1000)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="customerGroup" elementType="Argument">
              <stringProp name="Argument.name">customerGroup</stringProp>
              <stringProp name="Argument.value">${__P(customerGroup,10000)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="customerAccount" elementType="Argument">
              <stringProp name="Argument.name">customerAccount</stringProp>
              <stringProp name="Argument.value">${__P(customerAccount,100000)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="effectiveFromDate" elementType="Argument">
              <stringProp name="Argument.name">effectiveFromDate</stringProp>
              <stringProp name="Argument.value">${__P(effectiveFromDate,20210728)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Test Data LIst" enabled="false">
          <stringProp name="delimiter">\t</stringProp>
          <stringProp name="filename">${csvFileName}</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">customerId,supcIds</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
        </CSVDataSet>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${pHostname}</stringProp>
          <stringProp name="HTTPSampler.port">${serverPortHTTPS}</stringProp>
          <stringProp name="HTTPSampler.protocol">${serverProtocolHTTP}</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">4</intProp>
          <stringProp name="throughput">${pICTargetThroughput}</stringProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET- Get Submitted Requests" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">v1/cipz/pz-update-requests?offset=${offset}&amp;limit=${limit}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">X-Syy-Correlation-ID</stringProp>
                <stringProp name="Header.value">perf-cipz-${uniqueId}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">client-id</stringProp>
                <stringProp name="Header.value">cloud-pci-bff</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="Generate UniqueId for X-Correlation-Id" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="parameters">${__time(,timeStamp)}</stringProp>
            <stringProp name="script">import java.util.Random;
import java.util.UUID;
String uniqueId;

String timeStamp = vars.get(&quot;timeStamp&quot;);
uniqueId = UUID.randomUUID().toString().split(&quot;-&quot;)[0] + UUID.randomUUID().toString().split(&quot;-&quot;)[1] + &quot;_&quot; + timeStamp;
vars.put(&quot;uniqueId&quot;,uniqueId);</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
            <stringProp name="Assertion.scope">all</stringProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET- Get Submitted Requests with Query Params" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">v1/cipz/pz-update-requests?request_submitter=${request_submitter}&amp;request_status=${request_status}&amp;offset=${offset}&amp;limit=${limit}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">X-Syy-Correlation-ID</stringProp>
                <stringProp name="Header.value">perf-cipz-${uniqueId}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">client-id</stringProp>
                <stringProp name="Header.value">cloud-pci-bff</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="Generate UniqueId for X-Correlation-Id" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="parameters">${__time(,timeStamp)}</stringProp>
            <stringProp name="script">import java.util.Random;
import java.util.UUID;
String uniqueId;

String timeStamp = vars.get(&quot;timeStamp&quot;);
uniqueId = UUID.randomUUID().toString().split(&quot;-&quot;)[0] + UUID.randomUUID().toString().split(&quot;-&quot;)[1] + &quot;_&quot; + timeStamp;
vars.put(&quot;uniqueId&quot;,uniqueId);</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="Set Random request_submitter" enabled="true">
            <stringProp name="parameters">${__P(request_submitter,vvit5827)}</stringProp>
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import java.util.Random;
import java.util.concurrent.ThreadLocalRandom;

String[] randomReqSubmitter = {&quot;user1000&quot;, &quot;user1001&quot;, &quot;user1002&quot;, &quot;user1003&quot;, &quot;user1004&quot;, &quot;user1005&quot;, &quot;user1006&quot;, &quot;user1007&quot;, &quot;user1008&quot;, &quot;user1009&quot;, &quot;user1010&quot;, &quot;user1011&quot;, &quot;user1012&quot;, &quot;user1013&quot;, &quot;user1014&quot;, &quot;user1015&quot;, &quot;user1016&quot;, &quot;user1017&quot;, &quot;user1018&quot;, &quot;user1019&quot;};
int index = ThreadLocalRandom.current().nextInt(randomReqSubmitter.length);
vars.put(&quot;request_submitter&quot;,randomReqSubmitter[index]);
</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="Set Random request_status" enabled="true">
            <stringProp name="parameters">${__P(request_status,PENDING_APPROVAL)}</stringProp>
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import java.util.Random;
import java.util.concurrent.ThreadLocalRandom;

String[] randomReqStatus = {&quot;PENDING_APPROVAL&quot;};
int index = ThreadLocalRandom.current().nextInt(randomReqStatus.length);
vars.put(&quot;request_status&quot;,randomReqStatus[index]);
</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
            <stringProp name="Assertion.scope">all</stringProp>
          </ResponseAssertion>
          <hashTree/>
          <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable offset" enabled="true">
            <stringProp name="maximumValue">479</stringProp>
            <stringProp name="minimumValue">0</stringProp>
            <stringProp name="outputFormat">0</stringProp>
            <boolProp name="perThread">true</boolProp>
            <stringProp name="randomSeed">100</stringProp>
            <stringProp name="variableName">offset</stringProp>
          </RandomVariableConfig>
          <hashTree/>
        </hashTree>
        <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="Backend Listener -Test InfluxDB" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="influxdbMetricsSender" elementType="Argument">
                <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
                <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="influxdbUrl" elementType="Argument">
                <stringProp name="Argument.name">influxdbUrl</stringProp>
                <stringProp name="Argument.value">http://10.133.106.155:8086/write?db=jmeter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="application" elementType="Argument">
                <stringProp name="Argument.name">application</stringProp>
                <stringProp name="Argument.value">JMeterCIPZ-API</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="measurement" elementType="Argument">
                <stringProp name="Argument.name">measurement</stringProp>
                <stringProp name="Argument.value">jmeter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="summaryOnly" elementType="Argument">
                <stringProp name="Argument.name">summaryOnly</stringProp>
                <stringProp name="Argument.value">false</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="samplersRegex" elementType="Argument">
                <stringProp name="Argument.name">samplersRegex</stringProp>
                <stringProp name="Argument.value">.*</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="percentiles" elementType="Argument">
                <stringProp name="Argument.name">percentiles</stringProp>
                <stringProp name="Argument.value">50;90;95;99</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="testTitle" elementType="Argument">
                <stringProp name="Argument.name">testTitle</stringProp>
                <stringProp name="Argument.value">JMeterGetSubmittedRequestsTest</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="eventTags" elementType="Argument">
                <stringProp name="Argument.name">eventTags</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
          <stringProp name="TestPlan.comments">JMeterCIPZ-API</stringProp>
        </BackendListener>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <boolProp name="useGroupName">true</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>